{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v3.12.0", "signature": {"inputs": {"dense_374_input": {"name": "dense_374_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}, "outputs": {"dense_407": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_19/dense_374/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_374/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_375/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_375/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_376/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_376/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_377/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_377/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_378/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_378/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_379/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_379/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_380/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_380/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_381/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_381/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_382/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_382/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_383/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_383/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_384/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_384/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_385/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_385/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_386/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_386/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_387/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_387/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_388/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_388/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_389/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_389/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_390/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_390/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_391/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_391/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_392/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_392/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_393/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_393/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_394/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_394/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_395/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_395/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_396/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_396/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_397/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_397/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_398/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_398/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_399/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_399/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_400/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_400/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_401/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_401/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_402/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_402/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_403/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_403/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_404/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_404/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_405/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_405/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_406/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_406/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_407/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_407/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "dense_374_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_374/BiasAdd", "op": "_FusedMatMul", "input": ["dense_374_input", "StatefulPartitionedCall/sequential_19/dense_374/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_374/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_375/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_374/BiasAdd", "StatefulPartitionedCall/sequential_19/dense_375/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_375/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_375/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_375/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_376/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_375/Tanh", "StatefulPartitionedCall/sequential_19/dense_376/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_376/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_376/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_376/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_377/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_376/Tanh", "StatefulPartitionedCall/sequential_19/dense_377/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_377/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_377/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_377/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_378/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_377/Tanh", "StatefulPartitionedCall/sequential_19/dense_378/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_378/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_378/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_378/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_379/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_378/Tanh", "StatefulPartitionedCall/sequential_19/dense_379/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_379/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_379/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_379/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_380/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_379/Tanh", "StatefulPartitionedCall/sequential_19/dense_380/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_380/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_380/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_380/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_381/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_380/Tanh", "StatefulPartitionedCall/sequential_19/dense_381/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_381/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_381/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_381/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_382/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_381/Tanh", "StatefulPartitionedCall/sequential_19/dense_382/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_382/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_382/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_382/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_383/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_382/Tanh", "StatefulPartitionedCall/sequential_19/dense_383/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_383/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_383/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_383/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_384/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_383/Tanh", "StatefulPartitionedCall/sequential_19/dense_384/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_384/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_384/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_384/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_385/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_384/Tanh", "StatefulPartitionedCall/sequential_19/dense_385/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_385/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_385/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_385/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_386/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_385/Tanh", "StatefulPartitionedCall/sequential_19/dense_386/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_386/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_386/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_386/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_387/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_386/Tanh", "StatefulPartitionedCall/sequential_19/dense_387/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_387/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_387/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_387/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_388/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_387/Tanh", "StatefulPartitionedCall/sequential_19/dense_388/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_388/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_388/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_388/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_389/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_388/Tanh", "StatefulPartitionedCall/sequential_19/dense_389/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_389/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_389/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_389/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_390/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_389/Tanh", "StatefulPartitionedCall/sequential_19/dense_390/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_390/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_390/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_390/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_391/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_390/Tanh", "StatefulPartitionedCall/sequential_19/dense_391/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_391/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_391/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_391/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_392/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_391/Tanh", "StatefulPartitionedCall/sequential_19/dense_392/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_392/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_392/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_392/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_393/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_392/Tanh", "StatefulPartitionedCall/sequential_19/dense_393/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_393/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_393/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_393/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_394/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_393/Tanh", "StatefulPartitionedCall/sequential_19/dense_394/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_394/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_394/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_394/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_395/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_394/Tanh", "StatefulPartitionedCall/sequential_19/dense_395/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_395/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_395/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_395/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_396/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_395/Tanh", "StatefulPartitionedCall/sequential_19/dense_396/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_396/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_396/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_396/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_397/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_396/Tanh", "StatefulPartitionedCall/sequential_19/dense_397/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_397/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_397/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_397/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_398/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_397/Tanh", "StatefulPartitionedCall/sequential_19/dense_398/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_398/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_398/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_398/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_399/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_398/Tanh", "StatefulPartitionedCall/sequential_19/dense_399/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_399/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_399/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_399/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_400/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_399/Tanh", "StatefulPartitionedCall/sequential_19/dense_400/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_400/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_400/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_400/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_401/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_400/Tanh", "StatefulPartitionedCall/sequential_19/dense_401/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_401/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_401/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_401/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_402/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_401/Tanh", "StatefulPartitionedCall/sequential_19/dense_402/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_402/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_402/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_402/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_403/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_402/Tanh", "StatefulPartitionedCall/sequential_19/dense_403/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_403/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_403/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_403/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_404/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_403/Tanh", "StatefulPartitionedCall/sequential_19/dense_404/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_404/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_404/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_404/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_405/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_404/Tanh", "StatefulPartitionedCall/sequential_19/dense_405/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_405/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_405/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_405/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_406/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_405/Tanh", "StatefulPartitionedCall/sequential_19/dense_406/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_406/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_406/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_19/dense_406/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_19/dense_407/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_19/dense_406/Tanh", "StatefulPartitionedCall/sequential_19/dense_407/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_19/dense_407/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_19/dense_407/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 898}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_19/dense_374/MatMul/ReadVariableOp", "shape": [3, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_374/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_375/MatMul/ReadVariableOp", "shape": [3, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_375/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_376/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_376/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_377/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_377/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_378/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_378/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_379/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_379/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_380/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_380/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_381/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_381/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_382/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_382/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_383/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_383/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_384/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_384/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_385/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_385/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_386/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_386/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_387/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_387/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_388/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_388/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_389/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_389/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_390/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_390/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_391/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_391/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_392/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_392/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_393/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_393/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_394/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_394/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_395/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_395/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_396/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_396/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_397/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_397/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_398/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_398/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_399/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_399/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_400/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_400/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_401/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_401/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_402/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_402/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_403/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_403/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_404/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_404/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_405/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_405/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_406/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_406/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_407/MatMul/ReadVariableOp", "shape": [16, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_19/dense_407/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}]}]}